Тест/Тест/src/Catalogs/ВакансииКампании/ВакансииКампании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВакансииКампании</name>
  <attributes>
    <name>Статус</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияРаботы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Требования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолженЗнать</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Оплата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обязанности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧеловек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Интервьюеры</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест/Тест/src/InformationRegisters/АналитикаВакансий/АналитикаВакансий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналитикаВакансий</name>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КадровыйПриказ</name>
    <type>
      <types>DocumentRef.КадровыйПриказ</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Увольнение</name>
    <type>
      <types>DocumentRef.УвольненияСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРаботы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Вакансия</name>
    <type>
      <types>CatalogRef.ВакансииКампании</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест/Тест/src/Catalogs/ВопросыККандидату/ВопросыККандидату.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВопросыККандидату</name>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВопроса</name>
    <type>
      <types>CatalogRef.ТипыВопросов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Вакансии</name>
    <attributes>
      <name>Вакансия</name>
      <type>
        <types>CatalogRef.ВакансииКампании</types>
        <types>CatalogRef.Кандидаты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Должности</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиПредприятия</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест/Тест/src/Catalogs/ВакансииКампании/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ДолжностьПриИзменении(Элемент)
	
///+ТатарМА 27.09.2024
Объект.Наименование = Строка(Объект.Должность);
///-ТатарМА 27.09.2024

КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	Если Объект.Статус = Ложь Тогда
		Объект.ДатаЗакрытия = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список_ВопросыПоВакансии.Параметры.УстановитьЗначениеПараметра("Должность", Объект.Должность);
КонецПроцедуры


&НаКлиенте
Процедура Печать1(Команда)
ТабДок = Печать(Объект.ссылка);

// создадим коллекцию печатных форм, в которую надо будет добавить нужный нам табличный документ
КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Печать");
// Добавляем в коллекцию (тип массив) сформированный Табличный документ
КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
// если требуется устанавливаем параметры печати
КоллекцияПечатныхФорм[0].Экземпляров=1;
КоллекцияПечатныхФорм[0].СинонимМакета = "Печать";  // используется для формирования имени файла при сохранении из общей формы печати документов
// .. и выводим стандартной процедурой БСП
УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено,ЭтаФорма);

КонецПроцедуры

Функция Печать(Ссылка)
	Табдок= Новый ТабличныйДокумент;
	Макет = Справочники.ВакансииКампании.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВопросыККандидату.Наименование КАК Вопросы,
	|	ВакансииКампании.ДолженЗнать КАК ДолженЗнать,
	|	ВакансииКампании.Наименование КАК Наименование,
	|	ВакансииКампании.Обязанности КАК Обязанности,
	|	ВакансииКампании.Описание КАК Описание,
	|	ВакансииКампании.Оплата КАК Оплата,
	|	ВакансииКампании.Статус КАК Статус,
	|	ВакансииКампании.Требования КАК Требования,
	|	ВакансииКампании.УсловияРаботы КАК УсловияРаботы,
	|	ВакансииКампании.Интервьюеры.(
	|		Сотрудник КАК Сотрудник
	|	) КАК Интервьюеры
	|ИЗ
	|	Справочник.ВакансииКампании КАК ВакансииКампании
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВопросыККандидату КАК ВопросыККандидату
	|		ПО ВакансииКампании.Ссылка = ВопросыККандидату.Вакансии.Вакансия
	|ГДЕ
	|	ВакансииКампании.Ссылка В(&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ШапкаВопросы = Макет.ПолучитьОбласть("ШапкаВопросы");
	Вопросы = Макет.ПолучитьОбласть("Вопросы");
	Подпись = Макет.ПолучитьОбласть("Подпись");
	ТабДок.Очистить();
	
	Выборка.Следующий();
	
	ТабДок.Вывести(ОбластьЗаголовок);
	
	Шапка.Параметры.Заполнить(Выборка);
	ТабДок.Вывести(Шапка, Выборка.Уровень());
	
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	
	ТабДок.Вывести(ШапкаВопросы);
	
	Вопросы.Параметры.Заполнить(Выборка);
	Табдок.Вывести(Вопросы, Выборка.Уровень());
	
	Пока Выборка.Следующий() Цикл
		Вопросы.Параметры.Заполнить(Выборка);
		Табдок.Вывести(Вопросы, Выборка.Уровень());
	КонецЦикла;
	
	ВыборкаИнтервьюеры = Выборка.Интервьюеры.Выбрать();
	Пока ВыборкаИнтервьюеры.Следующий() Цикл
		Подпись.Параметры.Заполнить(ВыборкаИнтервьюеры);
		Табдок.Вывести(Подпись, Выборка.Уровень());	
	КонецЦикла;
	
	Возврат Табдок;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
///+ТатарМА 27.09.2024
Если Объект.Ссылка = Справочники.ВакансииКампании.ПустаяСсылка() Тогда
	Объект.Статус 		= Истина;
	Объект.ДатаСоздания = '00010101';
	Объект.ДатаЗакрытия = '00010101';
КонецЕсли;
///-ТатарМА 27.09.2024

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПередЗаписьюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере()
	
	///+ТатарМА 27.09.2024
	Если Объект.Ссылка = Справочники.ВакансииКампании.ПустаяСсылка() Тогда
		Объект.ДатаСоздания = '20240604';//ТекущаяДатаСеанса();
	КонецЕсли;
	///-ТатарМА 27.09.2024
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПослеЗаписиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере()
	
	///+ТатарМА 27.09.2024
	ЗаписьВРегистреСведений 			= РегистрыСведений.АналитикаВакансий.СоздатьМенеджерЗаписи();
	ЗаписьВРегистреСведений.Вакансия 	= Объект.Ссылка;
	ЗаписьВРегистреСведений.Прочитать();
		Если НЕ ЗаписьВРегистреСведений.Выбран() Тогда
			ЗаписьВРегистреСведений.Вакансия 		= Объект.Ссылка;
			ЗаписьВРегистреСведений.Ответственный 	= Объект.ОтветственныйЗаВакансию;
			ЗаписьВРегистреСведений.ДатаСоздания 	= Объект.ДатаСоздания;
			ЗаписьВРегистреСведений.Записать();
		КонецЕсли;
	///-ТатарМА 27.09.2024

КонецПроцедуры




&НаКлиенте
Процедура ДобавитьВопросы(Команда)
ОписаниеВыбора = Новый ОписаниеОповещения("ОбработатьВыборВопроса",ЭтаФорма);
	//ОткрытьФорму("");
ОткрытьФорму("Справочник.ВопросыККандидату.ФормаВыбора",,,,,,
ОписаниеВыбора,
РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	Элементы.СписокЧек.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборВопроса(РезультатЗакрытия,ДопПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
ЗаписьВакансии(РезультатЗакрытия);
Список_ВопросыПоВакансии.Параметры.УстановитьЗначениеПараметра("Вакансия",Объект.ссылка);
КонецПроцедуры

Процедура ЗаписьВакансии(Результат)
	Отбор = Новый Структура();
	Отбор.Вставить("Вакансия", Объект.Ссылка);
	ОбОбъект = Результат.ссылка.ПолучитьОбъект();
	НайденныеСтроки = ОбОбъект.Вакансии.НайтиСтроки(Отбор);
	Если  НайденныеСтроки.Количество() = 0 тогда
		НоваяСтрока = ОбОбъект.Вакансии.Добавить();
		НоваяСтрока.Вакансия = Объект.Ссылка;
		ОбОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовыйВопрос(Команда)
 ПараметрыОткрытия = Новый Структура("Кандидат_Вакансия", объект.Ссылка);
 ФормаВыбора = ПолучитьФорму("Справочник.ВопросыККандидату.Форма.ФормаЭлемента", ПараметрыОткрытия,ЭтаФорма);
 ВыбЭлемент = ФормаВыбора.ОткрытьМодально();
КонецПроцедуры


&НаСервере
Процедура УдалитьВопросНаСервере(ИмяВопроса)
	Отбор = Новый Структура();
	Отбор.Вставить("Вакансия", Объект.Ссылка);
	Попытка
		ОбВопроса = Справочники.ВопросыККандидату.НайтиПоНаименованию(ИмяВопроса).ПолучитьОбъект();
		
		НайденныеСтроки = ОбВопроса.Вакансии.НайтиСтроки(Отбор);
		
		Если  НайденныеСтроки.Количество() > 0 тогда
			Для Каждого мСтрока Из НайденныеСтроки Цикл
				ОбВопроса.Вакансии.Удалить(мСтрока);
				ОбВопроса.Записать();	
			КонецЦикла;
		КонецЕсли;
	Исключение
	КонецПопытки;
	Список_ВопросыПоВакансии.Параметры.УстановитьЗначениеПараметра("Вакансия",Объект.ссылка);	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВопрос(Команда)
	УдалитьВопросНаСервере(Элементы.Список_ВопросыПоВакансии.ТекущиеДанные.Наименование);
КонецПроцедуры
